Documents/VisitPlan.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>VisitPlan</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WeekNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Year</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Outlets</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Outlet</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Date</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/VisitPlan/Ext/ManagerModule.bsl
&НаСервере
// Формирует запрос по таблице "Outlets" документа
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка,отказ) Экспорт

	ПараметрыПроведения = Новый Structure;
     	//{{QUERY_BUILDER_WITH_RESULT_PROCESSING
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    Query = new Query;
	
	Query.SetParameter("Ref", ДокументСсылка);
	Query.Text = "SELECT ALLOWED
	             |	VisitPlan.Ref,
	             |	VisitPlan.Date,
	             |	VisitPlan.DateFrom,
	             |	VisitPlan.DateTo,
	             |	VisitPlan.SR
	             |FROM
	             |	Document.VisitPlan AS VisitPlan
	             |WHERE
	             |	VisitPlan.Ref = &Ref";
	
	Выборка = Query.Execute().Select();
	Выборка.Next();
	
	Реквизиты = Новый Structure("Ref,Date,SR,DateFrom,DateTo");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);

	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	VisitPlanOutlets.Outlet AS Outlet,
		|	VisitPlanOutlets.Date
		|FROM
		|	Document.VisitPlan.Outlets AS VisitPlanOutlets
		|WHERE
		|	VisitPlanOutlets.Ref = &Ref
		|
		|ORDER BY
		|	VisitPlanOutlets.LineNumber
		|TOTALS BY
		|	Outlet";

	Query.SetParameter("Ref", ДокументСсылка.Ref);

	ResultValueTree = Query.Execute().Unload(QueryResultIteration.ByGroups);
	
	DateНачалоНедели = ДатаПоНомеруНедели(ДокументСсылка.WeekNumber,Year(ДокументСсылка.Year));
	Реквизиты.Insert("Date",DateНачалоНедели);
	ПараметрыПроведения.Вставить("ValueTree",ResultValueTree);
    ПараметрыПроведения.Вставить("Реквизиты"   ,Реквизиты);
	
Возврат ПараметрыПроведения;
	
КонецФункции

&НаСервере
 //Как из номера, числа недели вернуть первую Дату этой
Функция ДатаПоНомеруНедели(НомерНедели,   Год =Неопределено) 
	 
Возврат НачалоНедели(Дата(?(Год=Неопределено,Год(ТекущаяДата()), Год),1,1)+(НомерНедели-НеделяГода(Дата(?(Год =Неопределено, Год(ТекущаяДата()), Год), 1, 1))) *604800);
 
КонецФункции
